temp_foam_regions/toml_export/system/controlDict
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

application     chtMultiRegionFoam;
startFrom       latestTime;
startTime       0;
stopAt          endTime;
endTime         10;
deltaT          0.01;
adjustTimeStep  yes;
maxCo           1;
maxDeltaT       1;
writeControl    adjustableRunTime;
writeInterval   5;

functions
{
    fluid_temperature_range
    {
        type fieldMinMax;
        libs (fieldFunctionObjects);
        region fluid;
        writeControl adjustableRunTime;
        writeInterval 1;
        fields (T);
        location true;
    }
    fluid_y_plus
    {
        type yPlus;
        libs (fieldFunctionObjects);
        region fluid;
        writeControl adjustableRunTime;
        writeInterval 1;
    }
    heated_block_0_temperature_range
    {
        type fieldMinMax;
        libs (fieldFunctionObjects);
        region heated_block_0;
        writeControl adjustableRunTime;
        writeInterval 1;
        fields (T);
        location true;
    }
    heated_block_0_temperature_average
    {
        type volFieldValue;
        libs (fieldFunctionObjects);
        region heated_block_0;
        writeControl adjustableRunTime;
        writeInterval 1;
        regionType all;
        operation volAverage;
        writeFields false;
        fields (T);
    }
}
