temp_foam_regions/toml_export/constant/fluid/fvOptions
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/fluid";
    object      fvOptions;
}

// No stamped flow devices.
