temp_foam_regions/toml_export/constant/fluid/radiationProperties
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/fluid";
    object      radiationProperties;
}

radiation off;
radiationModel none;
