temp_foam_regions/toml_export/constant/fluid/thermophysicalProperties
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/fluid";
    object      thermophysicalProperties;
}

thermoType
{
 type heRhoThermo;
 mixture pureMixture;
 transport sutherland;
 thermo janaf;
 equationOfState perfectGas;
 specie specie;
 energy sensibleEnthalpy;
}
dpdt no;
mixture
{
 specie { molWeight 28.97; }
 thermodynamics
 {
  Tlow 200; Thigh 6000; Tcommon 1000;
  lowCpCoeffs (3.5017115762157123 0 0 0 0 0 0);
  highCpCoeffs (3.5017115762157123 0 0 0 0 0 0);
 }
 transport { As 1.4552616300510174e-06; Ts 110.40000000000001; Pr 0.70999999999999996; }
}
