temp_foam_regions/toml_export/constant/heated_block_0/fvOptions
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/heated_block_0";
    object      fvOptions;
}

// No stamped heat sources.
