temp_foam_regions/toml_export/0/fluid/U
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0/fluid";
    object      U;
}

dimensions [0 1 -1 0 0 0 0];
internalField uniform (0 0 0);
boundaryField
{
rack_walls
{
 type noSlip;
}
fluid_to_heated_block_0
{
 type noSlip;
}
}
