temp_foam_regions/toml_export/0/fluid/p_rgh
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      p_rgh;
}

dimensions [1 -1 -2 0 0 0 0];
internalField uniform 81813.9;
boundaryField
{
rack_walls
{
 type fixedFluxPressure;
 value uniform 81813.898980;
}
fluid_to_heated_block_0
{
 type fixedFluxPressure;
 value uniform 81813.898980;
}
}
