temp_foam_regions/toml_export/0/heated_block_0/p
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/heated_block_0";
    object      p;
}

dimensions [1 -1 -2 0 0 0 0];
internalField uniform 101325;
boundaryField
{
heated_block_0_to_fluid
{
 type calculated;
 value uniform 101325;
}
".*"
{
 type calculated;
 value uniform 101325;
}
}
