temp_foam_regions/toml_export/0/fluid/T
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      T;
}

dimensions [0 0 0 1 0 0 0];
internalField uniform 293.14999999999998;
boundaryField
{
rack_walls
{
 type zeroGradient;
}
fluid_to_heated_block_0
{
 type compressible::turbulentTemperatureRadCoupledMixed;
 Tnbr T;
 kappaMethod fluidThermo;
 useImplicit true;
 qrNbr none;
 qr none;
 value uniform 293.14999999999998;
}
}
