temp_foam_regions/toml_export/0/fluid/alphat
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      alphat;
}

dimensions [1 -1 -1 0 0 0 0];
internalField uniform 0;
boundaryField
{
rack_walls
{
 type compressible::alphatWallFunction;
 Prt 0.84999999999999998;
 value uniform 0;
}
fluid_to_heated_block_0
{
 type compressible::alphatWallFunction;
 Prt 0.84999999999999998;
 value uniform 0;
}
}
