temp_foam_regions/toml_export/system/heated_block_0/fvSolution
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system/heated_block_0";
    object      fvSolution;
}

solvers
{
 h { solver PCG; preconditioner DIC; tolerance 1e-6; relTol 0.1; }
 hFinal { $h; relTol 0; }
}
PIMPLE { nNonOrthogonalCorrectors 0; }
