temp_foam_regions/toml_export/system/decomposeParDict
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}

numberOfSubdomains 2;
method scotch;
regions
{
    heated_block_0
    {
        numberOfSubdomains 1;
        method simple;
        coeffs { n (1 1 1); }
    }
}
